# 常用 Brewfile
# 適用: brew bundle --file=~/Brewfile
# 同期(未宣言を削除): brew bundle cleanup --file=~/Brewfile --force

tap "daipeihust/tap"

# --- CLI: 検索/ナビ ---
brew "fd"
brew "ripgrep"
brew "fzf"
brew "tree"

# --- CLI: Git ---
brew "git"
brew "gh"
brew "chezmoi"

# --- CLI: ビルド/ユーティリティ ---
brew "cmake"
brew "coreutils"
brew "curl"
brew "direnv"
brew "jq"

# --- CLI: Cloud ---
brew "awscli"

# --- CLI: エディタ/シェル ---
brew "neovim"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# --- CLI: Media ---
brew "ffmpeg"

# --- CLI: Language/Runtime ---
brew "mise"
brew "rust"
brew "uv"

# --- CLI: Mac 特化 ---
brew "daipeihust/tap/im-select"
brew "terminal-notifier"

# --- CLI: ネットワーク ---
brew "wireguard-tools"

# --- Cask: ターミナル ---
cask "ghostty"
cask "warp"

# --- Cask: 仮想化/コンテナ ---
cask "orbstack"

# --- Cask: Mac 拡張 ---
cask "karabiner-elements"

# --- Cask: 開発ツール ---
# codeql は将来 project-scope の Nix に移行予定
cask "codeql"
cask "ngrok"

# --- Cask: 文書/組版 ---
cask "mactex"
