# 常用 Brewfile (chezmoi source 内で管理。~/ には展開しない)
# chezmoi apply で自動適用される (.chezmoiscripts/run_onchange_after_40_brew-bundle.sh)
# 手動適用: brew bundle --file=~/.local/share/chezmoi/Brewfile
# 同期(未宣言を削除): brew bundle --file=~/.local/share/chezmoi/Brewfile cleanup --force

# --- CLI ツール ---
brew "git"
brew "chezmoi"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tree"
brew "gh"
brew "lefthook"
brew "mise"
brew "direnv"
brew "starship"
brew "awscli"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "uv"
brew "wireguard-tools"
brew "defuddle"
brew "poppler"
brew "terminal-notifier"
brew "tmux"

# --- zsh プラグイン ---
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- IME 切替 (nvim の im-select.nvim が使用) ---
tap "daipeihust/tap"
brew "daipeihust/tap/im-select"

# --- Cask: ターミナル ---
cask "ghostty"

# --- Cask: ノート/ドキュメント ---
cask "obsidian"

# --- Cask: 仮想化/コンテナ ---
cask "orbstack"

# --- Cask: Mac 拡張 ---
cask "karabiner-elements"

# --- Cask: 文書/組版 ---
cask "mactex"

# --- Cask: フォント ---
cask "font-udev-gothic-nf"
